---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Macros.MacroManager
source: html/99acdde0-eb08-c89c-12ae-e3aca246cd75.htm
---
# MacroManager Members

Adds a MacroModule to the application or document.